In [104]:
import pandas as pd
from datetime import datetime
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("BreadBasket_DMS.csv")

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21293 entries, 0 to 21292
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         21293 non-null  object
 1   Time         21293 non-null  object
 2   Transaction  21293 non-null  int64
 3   Item         21293 non-null  object
dtypes: int64(1), object(3)
memory usage: 665.5+ KB

In [10]:
df.head()

         Date      Time  Transaction           Item
0  2016-10-30  09:58:11            1          Bread
1  2016-10-30  10:05:34            2   Scandinavian
2  2016-10-30  10:05:34            2   Scandinavian
3  2016-10-30  10:07:57            3  Hot chocolate
4  2016-10-30  10:07:57            3            Jam

Write a function that takes this file as an input and to the following: 
a) Print the number of unique items 
b)  Print how many times each item was sold. 
c)  How many transactions contain Coffee. Note that you may have more than one coffee in one 
transaction.

In [14]:
print(df.Item.unique())

['Bread' 'Scandinavian' 'Hot chocolate' 'Jam' 'Cookies' 'Muffin' 'Coffee'
 'Pastry' 'Medialuna' 'Tea' 'NONE' 'Tartine' 'Basket' 'Mineral water'
 'Farm House' 'Fudge' 'Juice' "Ella's Kitchen Pouches" 'Victorian Sponge'
 'Frittata' 'Hearty & Seasonal' 'Soup' 'Pick and Mix Bowls' 'Smoothies'
 'Cake' 'Mighty Protein' 'Chicken sand' 'Coke' 'My-5 Fruit Shoot'
 'Focaccia' 'Sandwich' 'Alfajores' 'Eggs' 'Brownie' 'Dulce de Leche'
 'Honey' 'The BART' 'Granola' 'Fairy Doors' 'Empanadas' 'Keeping It Local'
 'Art Tray' 'Bowl Nic Pitt' 'Bread Pudding' 'Adjustment' 'Truffles'
 'Chimichurri Oil' 'Bacon' 'Spread' 'Kids biscuit' 'Siblings'
 'Caramel bites' 'Jammie Dodgers' 'Tiffin' 'Olum & polenta' 'Polenta'
 'The Nomad' 'Hack the stack' 'Bakewell' 'Lemon and coconut' 'Toast'
 'Scone' 'Crepes' 'Vegan mincepie' 'Bare Popcorn' 'Muesli' 'Crisps'
 'Pintxos' 'Gingerbread syrup' 'Panatone' 'Brioche and salami'
 'Afternoon with the baker' 'Salad' 'Chicken Stew' 'Spanish Brunch'
 'Raspberry shortbread sandwich' 'Extra Salami or Feta' 'Duck egg'
 'Baguette' "Valentine's card" 'Tshirt' 'Vegan Feast' 'Postcard'
 'Nomad bag' 'Chocolates' 'Coffee granules ' 'Drinking chocolate spoons '
 'Christmas common' 'Argentina Night' 'Half slice Monster ' 'Gift voucher'
 'Cherry me Dried fruit' 'Mortimer' 'Raw bars' 'Tacos/Fajita']

In [17]:
df.Item.unique().size

95

In [67]:
df.groupby(by = "Item")[["Transaction"]].sum().head(20)

                          Transaction
Item
Adjustment                        938
Afternoon with the baker       286028
Alfajores                     1512575
Argentina Night                 64153
Art Tray                       140877
Bacon                            1248
Baguette                      1109334
Bakewell                       272027
Bare Popcorn                    22420
Basket                           2369
Bowl Nic Pitt                    2028
Bread                        16213533
Bread Pudding                    3662
Brioche and salami              17936
Brownie                       1585847
Cake                          5932362
Caramel bites                    5101
Cherry me Dried fruit           26411
Chicken Stew                   876528
Chicken sand                       68

In [25]:
new_index = df.set_index("Item")

In [27]:
new_index.head()

                     Date      Time  Transaction
Item
Bread          2016-10-30  09:58:11            1
Scandinavian   2016-10-30  10:05:34            2
Scandinavian   2016-10-30  10:05:34            2
Hot chocolate  2016-10-30  10:07:57            3
Jam            2016-10-30  10:07:57            3

In [48]:
df.query("Item=='Coffee'").Transaction.unique().size

4528

In [51]:
new_index.loc["Coffee"]

              Date      Time  Transaction
Item
Coffee  2016-10-30  10:13:03            5
Coffee  2016-10-30  10:19:12            7
Coffee  2016-10-30  10:30:14           12
Coffee  2016-10-30  10:31:24           13
Coffee  2016-10-30  10:37:08           16
...            ...       ...          ...
Coffee  2017-04-09  12:32:03         9673
Coffee  2017-04-09  13:04:08         9674
Coffee  2017-04-09  13:49:21         9678
Coffee  2017-04-09  14:32:58         9682
Coffee  2017-04-09  14:57:06         9683

[5471 rows x 3 columns]

In [66]:
df.query("Item=='Coffee'").Transaction.nunique()

4528

In [77]:
df["date_time"] = df.Date + " " + df.Time

e) Print a table showing the monthly sales quantity of coffee and Tea.

In [78]:
df.date_time = pd.to_datetime(df["date_time"])

In [84]:
df.drop("date-time", axis = 1, inplace = True)

In [85]:
df.head()

         Date      Time  Transaction           Item           date_time
0  2016-10-30  09:58:11            1          Bread 2016-10-30 09:58:11
1  2016-10-30  10:05:34            2   Scandinavian 2016-10-30 10:05:34
2  2016-10-30  10:05:34            2   Scandinavian 2016-10-30 10:05:34
3  2016-10-30  10:07:57            3  Hot chocolate 2016-10-30 10:07:57
4  2016-10-30  10:07:57            3            Jam 2016-10-30 10:07:57

In [86]:
df.date_time

0       2016-10-30 09:58:11
1       2016-10-30 10:05:34
2       2016-10-30 10:05:34
3       2016-10-30 10:07:57
4       2016-10-30 10:07:57
                ...
21288   2017-04-09 14:32:58
21289   2017-04-09 14:32:58
21290   2017-04-09 14:57:06
21291   2017-04-09 14:57:06
21292   2017-04-09 15:04:24
Name: date_time, Length: 21293, dtype: datetime64[ns]

In [90]:
df_tea = df.query("Item == 'Coffee' or Item == 'Tea'")

In [92]:
df_tea.head()

          Date      Time  Transaction    Item           date_time
7   2016-10-30  10:13:03            5  Coffee 2016-10-30 10:13:03
15  2016-10-30  10:19:12            7  Coffee 2016-10-30 10:19:12
16  2016-10-30  10:19:12            7     Tea 2016-10-30 10:19:12
28  2016-10-30  10:30:14           12  Coffee 2016-10-30 10:30:14
31  2016-10-30  10:30:14           12     Tea 2016-10-30 10:30:14

In [89]:
df_tea

             Date      Time  Transaction    Item           date_time
7      2016-10-30  10:13:03            5  Coffee 2016-10-30 10:13:03
15     2016-10-30  10:19:12            7  Coffee 2016-10-30 10:19:12
28     2016-10-30  10:30:14           12  Coffee 2016-10-30 10:30:14
34     2016-10-30  10:31:24           13  Coffee 2016-10-30 10:31:24
44     2016-10-30  10:37:08           16  Coffee 2016-10-30 10:37:08
...           ...       ...          ...     ...                 ...
21269  2017-04-09  12:32:03         9673  Coffee 2017-04-09 12:32:03
21271  2017-04-09  13:04:08         9674  Coffee 2017-04-09 13:04:08
21276  2017-04-09  13:49:21         9678  Coffee 2017-04-09 13:49:21
21288  2017-04-09  14:32:58         9682  Coffee 2017-04-09 14:32:58
21290  2017-04-09  14:57:06         9683  Coffee 2017-04-09 14:57:06

[5471 rows x 5 columns]

In [93]:
df_tea.Item.value_counts()

Item
Coffee    5471
Tea       1435
Name: count, dtype: int64

In [98]:
df_tea.set_index("date_time", inplace = True)

In [105]:
# Result

df_tea.resample("MS").Item.value_counts().unstack()

Item        Coffee  Tea
date_time
2016-10-01      93   31
2016-11-01    1189  311
2016-12-01     932  235
2017-01-01     892  260
2017-02-01    1004  267
2017-03-01    1071  258
2017-04-01     290   73